BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90PWM1.PIC
        <edc:AdjustPoint edc:_addr="0xA6" edc:offset="0x7"/>
        <edc:SFRDef edc:_addr="0xAD" edc:access="nnnn-nnn" edc:cname="AC0CON" edc:nzwidth="0x8" ltx:memberofperipheral="AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC0M" edc:desc="Analog Comparator 0 Multiplexer Register" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AC0IS" edc:desc="Analog Comparator 0  Interrupt Select Bit" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="AC0IE" edc:desc="Analog Comparator 0 Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC0EN" edc:desc="Analog Comparator 0 Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xAE" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xAF" edc:access="nnnn-nnn" edc:cname="AC2CON" edc:nzwidth="0x8" ltx:memberofperipheral="AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC2M" edc:desc="Analog Comparator 2 Multiplexer Register" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AC2IS" edc:desc="Analog Comparator 2  Interrupt Select Bit" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Interrupt on Toggle" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Interrupt on Falling Edge" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Interrupt on Rising Edge" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="AC2IE" edc:desc="Analog Comparator 2 Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC2EN" edc:desc="Analog Comparator 2 Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xB0" edc:offset="0x20"/>
        <edc:SFRDef edc:_addr="0xD0" edc:access="--nn-n-n" edc:cname="PSOC0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POEN0A" edc:desc="PSCOUT00 Output Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN0B" edc:desc="PSCOUT01 Output Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PSYNC0" edc:desc="Synchronization Out for ADC Selection" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Send signal on leading edge of PSCOUTn0" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Send signal on trailing edge of PSCOUTn0" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Send signal on leading edge of PSCOUTn1" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Send signal on trailing edge of PSCOUTn1" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD1" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xD2" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR0SA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0"/>
        <edc:SFRDef edc:_addr="0xD4" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR0RA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0"/>
        <edc:SFRDef edc:_addr="0xD6" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR0SB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0"/>
        <edc:SFRDef edc:_addr="0xD8" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR0RB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0"/>
        <edc:SFRDef edc:_addr="0xDA" edc:access="nnnnnnn-" edc:cname="PCNF0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PCLKSEL0" edc:desc="PSC 0 Input Clock Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POP0" edc:desc="PSC 0 Output Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMODE0" edc:desc="PSC 0 Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="One Ramp Mode" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Two Ramp Mode" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Four Ramp Mode" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Center Aligned Mode" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PLOCK0" edc:desc="PSC 0 Lock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PALOCK0" edc:desc="PSC 0 Autolock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PFIFTY0" edc:desc="PSC 0 Fifty" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDB" edc:access="nnnnnnnn" edc:cname="PCTL0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRUN0" edc:desc="PSC 0 Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCCYC0" edc:desc="PSC0 Complete Cycle" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PARUN0" edc:desc="PSC0 Auto Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC0A" edc:desc="PSC 0 Asynchronous Output Control A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC0B" edc:desc="PSC 0 Asynchronous Output Control B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PBFM0" edc:desc="PSC 0 Balance Flank Width Modulation" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPRE0" edc:desc="PSC 0 Prescaler Selects" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No divider on PSC input clock" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Divide the PSC input clock by 4" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Divide the PSC input clock by 16" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Divide the PSC input clock by 64" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
