BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90PWM1.PIC
        <edc:SFRDef edc:_addr="0xDC" edc:access="nnnnnnnn" edc:cname="PFRC0A" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM0A" edc:desc="PSC 0 Retrigger and Fault Mode for Part A" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No action, PSC Input is ignored" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Stop signal, Jump to Opposite Dead-Time and Wait" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Stop signal, Execute Opposite Dead-Time and Wait" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Stop signal, Execute Opposite while Fault active" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="Deactivate outputs without changing timing." edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="Stop signal and Insert Dead-Time" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Stop signal, Jump to Opposite Dead-Time and Wait." edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Halt PSC and Wait for Software Action" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x08" edc:desc="Edge Retrigger PSC" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x09" edc:desc="Fixed Frequency Edge Retrigger PSC" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0A" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0B" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0C" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0D" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0E" edc:desc="Fixed Frequency Edge Retrigger PSC and Disactivate Output" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0F" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PFLTE0A" edc:desc="PSC 0 Filter Enable on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV0A" edc:desc="PSC 0 Edge Level Selector on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL0A" edc:desc="PSC 0 Input Select for Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE0A" edc:desc="PSC 0 Capture Enable Input Part A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDD" edc:access="nnnnnnnn" edc:cname="PFRC0B" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM0B" edc:desc="PSC 0 Retrigger and Fault Mode for Part B" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No action, PSC Input is ignored" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Stop signal, Jump to Opposite Dead-Time and Wait" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Stop signal, Execute Opposite Dead-Time and Wait" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Stop signal, Execute Opposite while Fault active" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="Deactivate outputs without changing timing." edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="Stop signal and Insert Dead-Time" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Stop signal, Jump to Opposite Dead-Time and Wait." edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Halt PSC and Wait for Software Action" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x08" edc:desc="Edge Retrigger PSC" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x09" edc:desc="Fixed Frequency Edge Retrigger PSC" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0A" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0B" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0C" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0D" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0E" edc:desc="Fixed Frequency Edge Retrigger PSC and Disactivate Output" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0F" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PFLTE0B" edc:desc="PSC 0 Filter Enable on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV0B" edc:desc="PSC 0 Edge Level Selector on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL0B" edc:desc="PSC 0 Input Select for Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE0B" edc:desc="PSC 0 Capture Enable Input Part B" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDE" edc:access="n---nnnnnnnnnnnn" edc:cname="PICR0" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PICR0" edc:desc="PSC 0 Capture Register" edc:nzwidth="0xC"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="PCST0" edc:desc="PSC 0 Capture Software Trig bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE0" edc:access="--nn-n-n" edc:cname="PSOC1" edc:nzwidth="0x8" ltx:memberofperipheral="PSC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POEN1A" edc:desc="PSCOUT10 Output Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN1B" edc:desc="PSCOUT11 Output Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PSYNC1" edc:desc="Synchronization Out for ADC Selection" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Send signal on leading edge of PSCOUTn0" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Send signal on trailing edge of PSCOUTn0" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Send signal on leading edge of PSCOUTn1" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Send signal on trailing edge of PSCOUTn1" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
